Revit 2024 API
MEPAnalyticalConnectionType.PressureLoss Property
 The pressure loss of this analytical connection type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public double PressureLoss { get; set; }
Visual Basic
Public Property PressureLoss As Double
	Get
	Set
Visual C++
public:
property double PressureLoss {
	double get ();
	void set (double value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for pressureLoss must be non-negative.
See Also
MEPAnalyticalConnectionType Class
Autodesk.Revit.DB Namespace